{
  "name": "Voice",
  "author": "x",
  "description": "Browser-based voice chat using WebRTC. Inspired by cake's voice chat for his gamemode 2raab.",
  "config": {
    "port": {
      "description": "The port the web server will run on.",
      "default": 7778,
      "type": "number"
    },
    "https": {
      "description": "Whether or not the server will run off of HTTPS. Disable this if you plan on using a reverse proxy to point to this server.",
      "default": true,
      "type": "boolean"
    },
    "proximity": {
      "description": "Whether or not to use proximity voice chat. People closer will sound louder.",
      "default": true,
      "type": "boolean"
    },
    "panning": {
      "description": "Whether or not audio should be spatialized so that voices from the left should be heard through only the left ear, and vice versa.",
      "default": true,
      "type": "boolean"
    },
    "max-distance": {
      "description": "The maximum distance away that a voice can be heard from an observer, in studs.",
      "default": 20,
      "type": "number"
    },
    "falloff-factor": {
      "description": "How much the voice volume should fall off over a distance as it reaches the maximum distance. Greater values mean that the voice will fall off more extremely at lower distances, creating an inverse square-ish curve.",
      "default": 2,
      "type": "number"
    },
    "voice-when-dead": {
      "description": "Whether or not a player's voice should transmit when they are dead.",
      "default": true,
      "type": "boolean"
    },
    "polling-rate": {
      "description": "The rate, in milliseconds, to poll user data and send to clients.",
      "default": 200,
      "type": "number"
    },
    "map-scale": {
      "description": "Describes how to translate a microstud (1/10 a stud) to a pixel on the minimap. At 0.1, one pixel is one stud.",
      "default": 0.3,
      "type": "number"
    },
    "tts": {
      "description": "Whether or not to use TTS to utter notifications on the website.",
      "default": false,
      "type": "boolean"
    },
    "show-chat": {
      "description": "Whether or not to show chat messages on the website.",
      "default": true,
      "type": "boolean"
    },
    "tts-chat": {
      "description": "Whether or not to utter chat messages on the website. TTS must be enabled for this setting to work.",
      "default": false,
      "type": "boolean"
    },
    "others-on-minimap": {
      "description": "Whether or not others should be visible on the minimap.",
      "default": true,
      "type": "boolean"
    },
    "dead-non-proximity": {
      "description": "If proximity is on, this option controls whether or not dead players can voice chat with each other globally (not proximally). The voice-when-dead option must be OFF for this to work.",
      "default": false,
      "type": "boolean"
    }
  },
  "commands": [
    {
      "name": "/auth",
      "description": "Links your in-game user with the website.",
      "example": "/auth abc123",
      "args": [
        {"name": "code", "description": "The randomly generated code.", "required": true}
      ]
    }
  ]
}
